export const DEFAULT_EXPENSE_CATEGORIES = [
  'Квартира',
  'КУ',
  'Продукты',
  'Еда вне дома',
  'Здоровье и уход',
  'Развлечения',
  'Подписки, связь, интернет',
  'Транспорт',
  'Автомобиль',
  'Топливо',
  'Бензин',
  'Газ',
  'ТО',
  'Такси',
  'Покупки',
  'Семья, друзья',
  'Лиза',
  'Кредиты',
  'Машина',
  'Учеба',
  'Сессия',
  'Дал в долг',
  'Прочее',
] as const;

export const DEFAULT_INCOME_CATEGORIES = [
  'Зарплата',
  'Фриланс',
  'Подарок',
  'Возврат долга',
] as const;

export type TransactionType = 'expense' | 'income';
